Repository: AirtonFreitas/aprendendo_flutter
Catalog: assets/lang/app_*.arb
Languages: es, pt

# titleApp
source: Learn Flutter
es: Aprende Flutter
pt: Aprender Flutter

# titleDart
source: Language Dart
es: Lenguaje de dardos
pt: Linguagem Dart

# syntaxTitle
source: Syntax
es: Sintaxis
pt: Sintaxe

# nameDart
source: Dart
es: Dardo

# nameWidgets
source: Widgets
es: Aparatos

# nameManagementState
source: State Management
es: Administración de estado
pt: Gerência de Estado

# whatFlutter
source: What is Flutter?
es: ¿Qué es Flutter?
pt: O que é o Flutter?

# whatDart
source: What is Dart?
es: ¿Qué es Dart?
pt: O que é o Dart?

# whatWidgets
source: What are Widgets?
es: ¿Qué son los widgets?
pt: O que são os Widgets?

# whatState
source: What is state manager?
es: ¿Qué es la gestión del estado?
pt: O que é gerência de estado?

# whatMultiplatform
source: What is being multiplatform?
es: ¿Qué es ser multiplataforma?
pt: O que é ser multiplataforma?

# learn
source: How to learn more?
es: ¿Cómo aprender más?
pt: Como aprender mais?

# learnApps
source: Learn more with our apps
es: Aprende más con nuestras aplicaciones
pt: Aprenda mais com nossos apps

# learnSqlTitle
source: Learning SQL
es: Aprender SQL
pt: Aprendendo SQL

# flutterDescription
source: Flutter is one of the leading frameworks for developing mobile applications.
es: Flutter es uno de los frameworks líderes para desarrollar aplicaciones móviles.
pt: O Flutter é um dos principais frameworks para o desenvolvimento de aplicações mobile.

# flutterDescriptionTwo
source: Created by Google, Flutter has developed native apps for Android and iOS from a single code base.
es: Creado por Google, con Flutter podemos desarrollar aplicaciones nativas para Android e iOS desde una única base de código
pt: Criado pela Google, com o Flutter conseguimos desenvolver aplicações nativas para Android e iOS a partir de um único código base.

# whatsflutterLanguage
source: What language does flutter use?
es: ¿Qué idioma usa flutter?
pt: Qual linguagem o flutter usa?

# flutterLanguage
source: Flutter uses a language also created by Google itself, called Dart.
es: Flutter usa un lenguaje también creado por el mismo Google, llamado Dart.
pt: O Flutter utiliza uma linguagem também criado pelo próprio Google, chamada Dart.

# dartDescript
source: is a platform-independent programming language. Open-source, object-oriented language that comprises a variety of useful features for a software developer.
es: es un lenguaje de programación independiente de la plataforma. Lenguaje de código abierto orientado a objetos que comprende una variedad de características útiles para un desarrollador de software.
pt: é uma linguagem de programação independente de qualquer plataforma. Linguagem de código aberto e orientada a objetos que compreende uma variedade de recursos úteis para um desenvolvedor de software.

# flutterDescript
source: is a portable UI toolkit complete with tools and widgets. It provides developers with a platform to build and deploy visually appealing, natively compiled applications for multiple platforms with ease.
es: es un conjunto de herramientas de interfaz de usuario portátil completo con herramientas y widgets. Brinda a los desarrolladores una plataforma para crear e implementar aplicaciones compiladas de forma nativa y visualmente atractivas para múltiples plataformas con facilidad
pt: é um kit de ferramentas de interface de usuário portátil completo com ferramentas e widgets. Ele fornece aos desenvolvedores uma plataforma para construir e implementar aplicativos compilados nativamente e visualmente atraentes para várias plataformas com facilidade.

# whatLearn
source: What will I learn in this app?
es: ¿Qué aprenderé en esta aplicación?
pt: O que vou aprender nesse app?

# detail
source: A bit more detail...
es: Un poco más de detalle...
pt: Detalhando um pouco...

# managementStateDescription
source: State management is basically the way we use to notify flutter when it needs to redraw a screen component, and how flutter will do it performatively. To do this management, we can use some libraries that will help us in this task. In our example we will use MOBX.
es: La gestión de estado es básicamente la forma que usamos para notificar a flutter cuando necesita volver a dibujar un componente de pantalla, y cómo flutter lo hará de forma eficaz. Para hacer esta gestión, podemos usar algunas bibliotecas que nos ayudarán en esta tarea. En nuestro ejemplo usaremos MOBX.
pt: A gerencia de estado é basicamente a forma que usamos para notificar o flutter quando ele precisa redesenhar um componente da tela, e como o flutter vai fazer isso de forma performática. Para fazer essa gerência, nós podemos usar algumas bibliotecas que vão nos auxiliar nessa tarefa. Em nosso exemplo usaremos o MOBX.

# managementStateElements
source: We have 3 main elements involved in this management. We have the Reactions, which mainly redraw the information on the screen. We have the Observables, which are the variables observed by flutter. Flutter will look at this Observable and rewrite it on the screen, in case there is a change in the Observable. And we have the Actions, which are responsible for changing the Observables.
es: Tenemos 3 elementos principales involucrados en esta gestión. Tenemos las Reacciones, que básicamente es volver a dibujar la información en la pantalla. Tenemos los Observables, que son las variables observadas por flutter. Flutter observará este Observable y reescribirlo en la pantalla, en caso de que haya un cambio en el Observable. Y tenemos las Acciones, que se encargan de cambiar los Observables.
pt: Nós temos 3 principais elementos envolvidos nessa gerência. Temos as Reactions, que basicamente é redesenhar na tela a informação. Temos os Observables, que são as variáveis observadas pelo flutter. O flutter vai olhar pra essa Observable e reescrever na tela, caso haja alteração na Observable. E temos as Actions, que são responsáveis por alterar os Observables.

# managementStateExample
source: In our example, flutter is drawing the balance of the user's account on the screen. At the moment the balance is R$632.00
es: En nuestro ejemplo, flutter dibuja el saldo de la cuenta del usuario en la pantalla. En este momento el saldo es de R$632,00
pt: No nosso exemplo, o flutter está desenhando ali na tela o saldo da conta do usuário. No momento o saldo é de R$632,00

# managementStateExampleTwo
source: After flutter drew the screen, the user received a transfer of BRL 50.00. The variable was changed, but flutter did not display the new balance yet.
es: Después de que flutter dibujó la pantalla, el usuario recibió una transferencia de BRL 50.00. La variable se cambió, pero flutter aún no mostró el nuevo saldo
pt: Depois que o flutter desenhou a tela, o usuário recebeu uma transferencia de R$50,00. A variável foi alterada, mas o flutter não exibiu ainda o novo saldo.

source: balance
es: saldo
pt: saldo

# functionDescription
source: This is the function that will receive the new balance.
es: Esta es la función que recibirá el nuevo saldo.
pt: Essa é a função que irá receber o novo saldo.

# valueDeposit
source: value deposited
es: valor depositado
pt: valor depositado

# valueInput
source: Input of the new balance of BRL 50.00
es: Ingreso del nuevo saldo de BRL 50,00
pt: Entrada do novo saldo de R$50,00

# newBalance
source: Right now the new balance is R$682.00
es: Ahora mismo el nuevo saldo es de R$682,00
pt: Neste momento o novo saldo é de R$682.00

# managementStateError
source: But our screen has not been redrawn. It keeps showing the value of R$632.00. So this is the role of state management.
es: Pero nuestra pantalla no ha sido redibujada. Sigue mostrando el valor de R$632.00. Así que este es el rol de la administración estatal.

# exampleMobx
source: Let's see how it looks with Mobx?
es: ¿Veamos cómo se ve con Mobx?
pt: Vamos ver como fica com Mobx?

# mobxDescription
source: So now the balance is an OBSERVABLE value, that is, that can be observed by someone. Now our ACTION is responsible for changing the value of this observable value.
es: Entonces ahora el saldo es un valor OBSERVABLE, es decir, que puede ser observado por alguien. Ahora nuestra ACCIÓN se encarga de cambiar el valor de este valor observable.
pt: Então agora o saldo é um valor OBSERVABLE, ou seja, que pode ser observado por alguém. Agora o responsável por alterar o valor desse valor observável é a nossa ACTION.

# mobxDescriptionTwo
source: And now our flutter, which is inside an OBSERVER, is now an observer. It keeps looking at the OBBSERVABLE. When there is a change, it will redraw the widget and show the new value.
es: Y ahora nuestro flutter, que está dentro de un OBSERVADOR, ahora es un observador. Sigue mirando el OBBSERVABLE. Cuando hay un cambio, vuelve a dibujar el widget y muestra el nuevo valor
pt: E agora o nosso flutter, que está dentro de um OBSERVER, agora é um observador. Ele fica olhando para o OBBSERVABLE. Quando houver uma alteração, ele irá redesenhar o widget e mostrar o novo valor.

# managementStateConclude
source: In a nutshell, this is the role of State Management.
es: En pocas palabras, esta es la función de la administración estatal
pt: De forma resumida, essa é a função da Gerência de Estado.

# introduction
source: For the information below, I am assuming that you already know how to work an algorithm and already have knowledge in programming logic.
es: Para la siguiente información, asumo que ya sabes cómo funciona un algoritmo y ya tienes conocimientos en lógica de programación.
pt: Para as informações abaixo, estou considerando que você já sabe como funciona um algoritmo e já tem conhecimento em lógica de programação.

# dartDescription
source: Dart is a strongly typed programming language initially created by Google in 2011. Dart's initial mission was to replace JavaScript for scripting web pages.
es: Dart es un lenguaje de programación fuertemente tipado creado inicialmente por Google en 2011. La misión inicial de Dart era reemplazar JavaScript para crear secuencias de comandos de páginas web
pt: O Dart é uma linguagem de programação fortemente tipada inicialmente criada pela Google em 2011. A missão inicial do Dart era substituir o JavaScript para desenvolvimento de scripts em páginas web.

# dartEvolution
source: However, with the evolution of the language and over the years, it can now be considered a multiparadigm language, although the language has strong structures typical of object-oriented languages. I'll show you some of the syntax darts.
es: Sin embargo, con la evolución del lenguaje y a lo largo de los años, ahora puede considerarse un lenguaje multiparadigma, aunque el lenguaje tiene estructuras sólidas típicas de los lenguajes orientados a objetos. Te mostraré algunas de la sintaxis do dart.
pt: Porém, com a evolução da linguagem e com o passar dos anos, ela hoje pode ser considerada uma linguagem multi-paradigma, embora a linguagem apresente fortes estruturas típicas de linguagens orientadas a objeto. Vou mostrar um pouco da sintaxe do dart.

# firstSee
source: First, let's see what a simple 'Hello World' would look like in dart.
es: Primero, veamos cómo se vería un simple 'Hello World' en dart
pt: Primeiro vamos ver como seria um simples 'Hello World' em dart.

# variablesCreate
source: You can create a variable without declaring exactly the type of the variable. But the type of the variable is inferior the moment you declare a value for the variable.
es: Puedes crear una variable sin declarar el tipo exacto de la variable. Pero el tipo de la variable se infiere en el momento en que declaras un valor para la variable.
pt: Você pode criar uma variável sem declarar exatamente o tipo da variável. Mas o tipo da variável é inferido no momento em que você declarar um valor para a variável.

# variableDynamic
source: Then the 'var' type becomes dynamic if a value is not defined for the variable. After defining some value for the variable, it has the lower type. And after that, we cannot change the type of the variable.
es: Entonces el tipo 'var' se vuelve dinámico si no se define un valor para la variable. Después de definir algún valor para la variable, tiene el tipo inferido. Y después de eso, no podemos cambiar el tipo de la variable.
pt: Então o tipo 'var' fica como dynamic caso não seja definido um valor para a variável. Após a definição de algum valor para variável ela tem o tipo inferido. E após isso não temos como alterar o tipo da variável.

# variableCreateType
source: And you can also create a variable by declaring the format directly:
es: Y también puedes crear la variable declarando el formato directamente:
pt: E você pode também criar a variável declarando o formato diretamente:

# rememberingVariable
source: Remembering that it is not possible to change the format of the variable.
es: Recordando que no es posible cambiar el formato de la variable.
pt: Lembrando que não é possível alterar o formato da variável.

# variablesConst
source: Constant Variables
es: Variables constantes
pt: Variáveis Constantes

# variablesConstCreate
source: To declare a constant variable, just use the word 'final' instead of 'var'.
es: Para declarar una variable constante, solo usa la palabra 'final' en lugar de 'var'.
pt: Para declarar uma variável constante, basta ao invés de 'var', usar a palavra 'final'.

# ifAndElseTitle
source: If and Else
es: Si y si no
pt: If e Else

# ifAndElseExample
source: For the example below, if the balance is greater than or equal to the Withdrawal amount, it will allow to withdraw. Otherwise, the system will not withdraw.
es: Para el siguiente ejemplo, si el saldo es mayor o igual al monto del Retiro, permitirá retirar. De lo contrario, el sistema no realizará retiros.
pt: Para o exemplo abaixo, se o saldo for maior ou igual ao valorSaque, ele permitirá realizar o saque. Senão o sistema não fará o saque.

# ifAndElseConditions
source: Between the parentheses we have the IF condition, if it meets the conditions the code inside the braces will be executed. If it doesn't meet the conditions, the code inside the ELSE braces will be executed.
es: Entre paréntesis tenemos la condición IF, si cumple las condiciones se ejecutará el código dentro de las llaves. Si no cumple las condiciones, se ejecutará el código dentro de las llaves ELSE.
pt: Entre os parênteses temos a condição do IF, caso atenda as condições o código dentro das chaves será executado. Caso não atenda as condições, será executado o código dentro das chaves do ELSE.

# forTitle
source: For
es: Para

# forExample
source: For the FOR loop example, it will count the numbers until it reaches the number 10.
es: Para el ejemplo del bucle FOR, contaremos los números hasta llegar al número 10.
pt: Para o exemplo do laço de repetição FOR, faremos uma contagem dos números até alcançar o número 10.

# forDescription
source: As we know, the for loop consists of executing an action a certain number of times. And inside the parentheses() we have 3 parameters.
es: Como sabemos, el bucle for consiste en ejecutar una acción un cierto número de veces. Y dentro de los paréntesis() tenemos 3 parámetros.
pt: Conforme sabemos, o laço for consiste em executar uma ação por um número determinado de vezes. E dentro dos parênteses() nós temos 3 parâmetros.

# forVariableControl
source: Variable for control
es: Variable para control
pt: Variável para controle

# forConditions
source: Condition to execute
es: Condición para ejecutar
pt: Condição para executar

# forAnd
source: and
es: y
pt: e

# forIncrementVariable
source: Variable increment
es: Incremento de variable
pt: Incremento da variável

# forDescriptionT
source: . And with that we have our
es: . Y con eso tenemos nuestro
pt: . E com isso nós temos nosso

# forCode
source: code snippet
es: fragmento de código
pt: trecho de código

# forRepet
source: being repeated, as many times as we need.
es: repitiendo tantas veces como sea necesario.
pt: sendo repetido, quantas vezes precisarmos.

# switchTitle
source: Switch
es: Cambiar

# switchDescription
source: The Switch command has the function of executing a certain code when it meets a specific condition. It is usually used when we have several possible options.
es: El comando Cambiar tiene la función de ejecutar un código determinado cuando cumple una condición específica. Se suele usar cuando tenemos varias opciones posibles.
pt: O comando Switch tem a função de executar um determinado código quando atender a uma condição específica. E geralmente é usado quando temos várias opções possíveis.

# switchState
source: State
es: Estado
pt: Estado

# switchMG
source: 'MG Tax is 18%'
es: 'El impuesto de MG es del 18%'
pt: 'O Imposto de MG é 18%'

# switchAC
source: 'AC Tax is 17%'
es: 'El impuesto AC es 17%'
pt: 'O Imposto de AC é 17%'

# switchAL
source: 'AL Tax is 12%'
es: 'El impuesto AL es del 12%'
pt: 'O Imposto de AL é 12%'

# switchRJ
source: 'RJ Tax is 18%'
es: 'El impuesto de RJ es del 18%'
pt: 'O Imposto de RJ é 18%'

# switchSC
source: 'SC Tax is 17%'
es: 'El impuesto SC es 17%'
pt: 'O Imposto de SC é 17%'

# switchDefault
source: 'Sale unavailable for your state.
es: 'Venta no disponible para su estado'
pt: 'Venda indisponível para seu estado.'

# switchExample
source: For example in this example above, the Switch is testing which STATE is being informed. 'If it is one of the examples, it will print the exact rate. But if the state is unknown, it will enter the DEFAULT option and will display the message that the sale is unavailable.
es: Por ejemplo, en este ejemplo anterior, el Switch está probando qué ESTADO está siendo informado. 'Si es uno de los ejemplos, imprimirá exactamente la alícuota. Pero si el estado es desconocido, lo hará ingrese la opción PREDETERMINADO y mostrará el mensaje de que la venta no está disponible.
pt: Por exemplo esse exemplo acima, o Switch está testando qual o ESTADO está sendo informado. 'Caso seja algum dos exemplos ele irá printar exatamente a aliquota. Mas caso o estado desconhecido, ele irá entrar na opção DEFAULT e irá exibir a mensagem que a venda está indisponível.

# reading
source: Continue reading...
es: Continuar leyendo...
pt: Continuar lendo...

# multplatformIntroduction
source: Flutter has a great advantage over other technologies, which is that it is cross-platform. A flutter developer can program for Android, IOS, web and even desktop.
es: Flutter tiene una gran ventaja sobre otras tecnologías, y es que es multiplataforma. Un desarrollador de flutter puede programar para Android, IOS, web e incluso escritorio
pt: O flutter tem uma grande vantagem sobre outras tecnologias, que é ser multiplataforma. Um desenvolvedor flutter consegue programar para Android, IOS, web e até mesmo para desktop.

# multplatformDescription
source: When compared to other frameworks, flutter has a great advantage. The cost of Flutter is generally lower. Because in some cases it takes an IOS development team and another Android development team. And in this case from flutter you don't need a specific team for each platform, I checked the costs considerably.
es: Cuando se compara con otros frameworks, flutter tiene una gran ventaja. El costo de Flutter es generalmente más bajo. Porque en algunos casos se necesita un equipo de desarrollo de IOS y otro de Android. Y en este caso con flutter , no necesitas un equipo específico para cada plataforma, reduciendo costes considerablemente.
pt: Quando comparamos com outros frameworks, o flutter tem uma grande vantagem. O custo do Flutter geralmente é menor. Pois em alguns casos é preciso uma equipe de desenvolvimento IOS e outra equipe de desenvolvimento Android. E no caso do flutter não é preciso uma equipe específica para cada plataforma, diminuindo consideravelmente os custos.

# multplatformDescriptionTwo
source: We have different platforms, different operating systems and each of these operating systems requires that the development of applications be in a specific language. For example IOS and Android. Both are 'mobile' but Android uses Java language and Kotlin , when IOS uses Swift.
es: Tenemos diferentes plataformas, diferentes sistemas operativos y cada uno de estos sistemas operativos requiere que el desarrollo de aplicaciones sea en un lenguaje específico. Por ejemplo IOS y Android. Ambos son 'móviles' pero Android usa el lenguaje Java y Kotlin , mientras que IOS usa Swift.
pt: Temos diferentes plataformas, diferentes sistemas operacionais e cada um desses sistemas operacionais exige que o desenvolvimento das aplicações seja em uma linguagem específica. Por exemplo IOS e Android. Ambos são 'mobile' mas Android usa a linguagem Java e Kotlin, enquando o IOS usa o Swift.

# multplatformConclude
source: With flutter we have the possibility to program just once, just one code and you will have the option to generate versions for both operating systems. That's being multiplatform.
es: Con flutter tenemos la posibilidad de programar solo una vez, solo un código y tendrás la opción de generar versiones para ambos sistemas operativos. Eso es ser multiplataforma.
pt: Com o flutter temos a possibilidade de programar apenas uma vez, apenas um código e terá a opção de gerar versões para ambos sistemas operacionais. Isso é ser multiplataforma.

# learMore
source: You must be sad, how can I learn more?
es: Quizás te estés preguntando, ¿cómo puedo obtener más información?
pt: Você deve estar se perguntando, como posso aprender mais?

# channelYoutube
source: There are many YouTube channels that will help you a lot when you are just starting out.
es: Hay muchos canales de YouTube que te ayudarán mucho cuando recién estés comenzando
pt: Existem muitos canais do Youtube que vão ajudar muito você que está começando.

# myApps
source: My Teaching Apps
es: Mis aplicaciones de enseñanza
pt: Meus apps de ensino

# callMe
source: Call me on linkedIn to talk about technology
es: Llámame en linkedIn para hablar sobre tecnología
pt: Me chame no linkedIn para conversar sobre tecnologia

# officialChannels
source: Official Flutter and Dart sites
es: Sitios oficiales de Flutter y Dart
pt: Sites oficiais do Flutter e Dart

# rateMe
source: Rate the app
es: Califica la aplicación
pt: Avalie o app

# like
source: What did you think of the app?
es: ¿Qué te pareció la aplicación?
pt: O que você achou do app?

# widgetsLayoutTitle
source: Layout Widgets
es: Widgets de diseño
pt: Widgets de Layout

# widgetsInterfacetTitle
source: Interface Widgets
es: Aparatos de interfaz
pt: Widgets de Interface

# widgetsIntroduction
source: Flutter's screen components are made based on a set of Widgets. A widget is a visual component in the device's interface.
es: Los componentes de la pantalla de Flutter están hechos en base a un conjunto de widgets. Un widget es un componente visual en la interfaz del dispositivo
pt: Os componentes de telas do flutter são feitos com base em um conjunto de Widgets. Um widget é um componente visual na interface do dispositivo.

# widgetsCategoryTitle
source: Widgets are divided into two categories
es: Los widgets se dividen en dos categorías
pt: Os widgets são divididos em duas categorias

# widgetsLayout
source: Layout
es: Diseño

# widgetsInterface
source: Interface
es: Interfaz

# widgetsLayoutDescription
source: Layout widgets are the widgets that lay out the screen. And they get the interface widgets.
es: Los widgets de diseño son los widgets que diseñan la pantalla. Y obtienen los widgets de la interfaz
pt: Widgets de Layout são os widgets que organizam a tela. E recebem os widgets de interface.

# widgetsInterfaceDescription
source: Interface widgets are the widgets that will be displayed in the user interface.
es: Los widgets de interfaz son los widgets que se mostrarán en la interfaz de usuario.
pt: Widgets de interface são os widgets que irão ser exibidos na interface do usuário.
