Repository: AirtonFreitas/aprendendo_flutter
Catalog: assets/lang/app_*.arb
Languages: es, pt

# widgetsDescription
source: Now we know how widgets work and some of the most common examples. There are several other widgets that can be used and each one has its peculiarities. The recommendation is to always seek to learn more and from reliable sources.
es: Ahora sabemos cómo funcionan los widgets y algunos de los ejemplos más comunes. Hay varios otros widgets que se pueden usar y cada uno tiene sus peculiaridades. La recomendación es buscar siempre aprender más y de fuentes confiables. fuentes.
pt: Agora já sabemos como funcionam os widgets e alguns dos exemplos mais comuns. Existem vários outros widgets que podem ser utilizados e cada um possui suas peculiaridades. A recomendação é sempre buscar aprender mais e em fontes confiáveis.

# widgetsScaffoldDescription
source: The Scaffold is a flutter class that provides many interface widgets such as Drawer, BottonNavigationBar, FloatingActionButton, AppBar, Body and others. The Scaffold will expand and occupy the entire device screen, occupying all available space.
es: Scaffold es una clase flutter que proporciona muchos widgets de interfaz como Drawer, BottonNavigationBar, FloatingActionButton, AppBar, Body y otros. Scaffold se expandirá y ocupará toda la pantalla del dispositivo, ocupando todo el espacio disponible.
pt: O Scaffold é uma classe em flutter que fornece muitos widgets de interface como Drawer, BottonNavigationBar, FloatingActionButton, AppBar, Body entre outros. O Scaffold irá expandir e ocupar toda a tela do dispositivo, ocupando todo o espaço disponível.

# widgetsScaffoldDescriptionTwo
source: In the code shown above, we only have the declaration of some Scaffold properties, but we don't have the interface widgets that will be displayed. In order for the interface components to be displayed (appBar, drawer, body), we need to declare each widget. To create a screen similar to this one, the code would be this:
es: En el código que se muestra arriba, solo tenemos la declaración de algunas propiedades de Scaffold, pero no tenemos los widgets de la interfaz que se mostrarán. Para que se muestren los componentes de la interfaz (appBar, cajón, cuerpo), necesitamos declarar cada widget. Para crear una pantalla similar a esta, el código sería este:
pt: No código exibido acima, temos somente a declaração de algumas propriedades do Scaffold, mas não temos o widgets de interface que será exibido. Para que seja exibido os componentes de interface(appBar, drawer, body), precisamos declarar cada widget. Para criar uma tela semelhante a esta, o código seria este:

# widgetScaffoldReceived
source: Then our Scaffold will receive some interface widgets, which will be displayed, each one in its place.
es: Entonces nuestro Scaffold recibirá algunos widgets de interfaz, los cuales se mostrarán, cada uno en su lugar.
pt: Então o nosso Scaffold irá receber alguns widgets de interface, que serão exibidos, cada um em seu lugar.

# widgetContainerIntro
source: A container is a widget that has properties for sizing, rounding, colors and spacing. Basically a container is a 'box' to store content. It gets other widgets from the 'child:' property.
es: Un contenedor es un widget que tiene propiedades de tamaño, redondeo, colores y espaciado. Básicamente, un contenedor es una 'caja' para almacenar contenido. Obtiene otros widgets de la propiedad 'child:'
pt: Um container é um widget que possui propriedades para dimensionamento, arredondamento, cores e espaçamento. Basicamente um container é uma 'caixa' para armazenar conteúdo. Ele recebe outros widgets a partir da propriedade 'child:'.

# widgetContentContainer
source: text to display
es: texto para mostrar
pt: texto que será exibido

# widgetExample
source: In this example we have a widget with several properties. Height 70, Width 70, Background color. And we have the text being displayed inside this widget.
es: En este ejemplo, tenemos un widget con varias propiedades. Alto 70, Ancho 70, Color de fondo. Y tenemos el texto que se muestra dentro de este widget.
pt: Neste exemplo temos um widget com várias propriedades. Altura 70, Largura 70, Cor de fundo. E temos dentro deste widget o texto sendo exibido.

# widgetColumns
source: Other widgets often used for building layouts are Columns and Rows (columns and rows). These widgets in particular are used to position the interface widgets.
es: Otros widgets que se usan a menudo para crear diseños son Columns y Rows (columnas y filas). Estos widgets en particular se usan para colocar los widgets de la interfaz.
pt: Outros widgets muito usados para construção de layouts são as Columns e Rows (colunas e linhas). Estes widgets em especial, são usados para posicionar os widgets de interface.

# widgetColumnsDescription
source: Columns stack widgets vertically, while Rows stack horizontally. We have two very important properties for these widgets which are 'mainAxisAlignment' and 'crossAxisAlignment'. These two properties are responsible for organizing all the components inside the widget.
es: Las columnas apilan los widgets verticalmente, mientras que las Filas se apilan horizontalmente. Tenemos dos propiedades muy importantes para estos widgets que son 'mainAxisAlignment' y 'crossAxisAlignment'. Estas dos propiedades son responsables de organizar todos los componentes dentro del widget.
pt: As Columns fazem o empilhamento vertical dos widgets, enquanto as Rows fazem o enfileiramento horizontal. Temos duas propriedades muito importantes para esses widgets que são 'mainAxisAlignment' e 'crossAxisAlignment'. Essas duas propriedades são responsáveis por organizar todos os componentes dentro do widget.

# fisrt
source: first
es: primero
pt: primeiro

source: second
es: segundo
pt: segundo

source: third
es: tercero
pt: terceiro

# widgetImagesTitle
source: Images
es: Imágenes
pt: Imagens

# widgetImagesDescription
source: We have the option to display an image in the flutter app directly from the internet, or saved inside a local folder. To display an image on the screen, we use this 'Image()' widget.
es: Tenemos la opción de mostrar una imagen en la aplicación flutter directamente desde Internet, o guardada dentro de una carpeta local. Para mostrar una imagen en la pantalla, usamos este widget 'Imagen()'.
pt: Temos a opção de exibir uma imagem no app flutter diretamente da internet, ou salva dentro de uma pasta local. Para exibir uma imagem na tela, usamos esse widget 'Image()'.

# widgetImageUrl
source: image url
es: URL de la imagen
pt: url da imagem

# widgetImageLocal
source: local image path
es: ruta de la imagen local
pt: caminho local da imagem

# widgetImageExample
source: As an example, let's take an image from another application and display it here on our screen.
es: Como ejemplo, tomemos una imagen de otra aplicación y mostrémosla aquí en nuestra pantalla.
pt: Como exemplo, vamos pegar uma imagem de um outro aplicativo e exibir aqui em nossa tela.

# widgetTextTitle
source: Texts
es: Textos
pt: Textos

# widgetTextDescription
source: To display a text on the screen, we can use this 'Text()' widget.
es: Para mostrar un texto en la pantalla, podemos usar este widget 'Text()'.
pt: Para exibir um texto na tela, podemos usar esse widget 'Text()'.

# widgetTest
source: Test a Text
es: Probar un Texto
pt: Teste de um Text

# widgetIconsTitle
source: Icons
es: Iconos
pt: Icones

# widgetIconsDescription
source: Flutter has several icons that we can use to create our layouts. For that we can use the Icon() widget.
es: Flutter tiene varios íconos que podemos usar para crear nuestros diseños. Para eso podemos usar el widget Icon()
pt: O flutter possui vários ícones que podemos usar para criar nossos layouts. Para isso podemos usar o widget Icon().

# widgetButtonsTitle
source: Buttons
es: Botones
pt: Botões

# widgetButtonsDescription
source: We have several widgets that can do the 'touch capture' function, that is, buttons. An example is TextButton().
es: Tenemos varios widgets que pueden hacer la función de 'captura táctil', es decir, botones. Un ejemplo es TextButton().
pt: Temos vários widgets que podem fazer a função de 'captura de toque', ou seja, botões. Um exemplo é o TextButton().

# widgetButtonSend
source: Send
es: Enviar
pt: Enviar

# nameMultiplatform
source: Multiplatform
pt: Multiplataforma

# receivedDeposit
source: receiveDeposit
pt: recebeDeposito

source: Variables
pt: Variáveis
